{
  "general" : {
    "title" : "Introduction",
    "introduction": "In a bike-sharing system, the availability of bikes in the different stations is a critical point of the system; a customer that cannot take a bike at a station as he planned will be frustrated and potentially lost.  For the bike network manager, this implies a constant rebalancing of the bikes present in the network according to the daily demand that strongly varies depending on many factors (weather conditions, local events, date, etc.). By using bike usage predictive and rebalancing algorithms, this project will minimize the rebalancing tasks that must be performed by the bike network manager while ensuring an optimal quality of service for the final customer.",
    "intro": "The developed system will be applied and evaluated in real conditions on three different bike networks managed by Intermobility SA in early 2019"
  },
    "features": [
    {
      "title": "Prediction",
      "image": "assets/prediction.png",
      "text": "The developed prediction system relies on historical data bike usage provided by Intermobility, weather conditions and local holiday dates to generate bike usage prediction for each considered bike network. The models for bike usage prediction are generated by supervised machine learning algorithms. In the context of this project, we notably use Random Forest and Long Short-Term Memory algorithms to obtain the best possible prediction accuracy for different horizons."
    },
    {
      "title": "Rebalancing",
      "image": "assets/rebalancing.png",
      "text": "The developed balancing system relies on the current state of the bike network and on the predictions generated by our algorithms. Upon request, the system is able to provide optimal routes and operations for the teams that perform the rebalancing operations; these operations will ensure a sufficient number of bikes in each station of the network to fulfill the future demand."
    },
    {
      "title": "Visualization",
      "image": "assets/visualization.png",
      "text": "The developed visualization plateform will allow bike network managers to monitor the current status of his bike network(s) as well as the predictions of bike usage at each station for different time horizons (up to 12 hours ahead). Additionally he will be able to manage rebalancing missions performed by his teams on the field. Upon request, the system will produce optimal missions (routes and operations at each station) to equilibrate the number of bikes at each station according to pre-defined target thresholds and boundaries. He will be able to assign a mission to a specific team. The teams on the field will automatically obtain clear instructions on their tablet on the tasks that they must perform."
    }
  ],
  "team": [
    {
      "name": "François Kuonen",
      "image": "assets/francois.jpg",
      "text": "François Kuonen, CEO of Intermobility SA and co-developper of the velospot® bike-sharing system, holds a degree in architecture and formation in urban planning. Having worked until spring 2015 for different public authorities, the one who has been responsible for the town planning department of the city of Biel / Bienne (1998 to 2015) has always coordinated his activities as an urban planner in close connection with the conduct of projects in the field of shared mobility. Whether in the form of electric self-service cars in Martigny (CityCar project - 1996 to 2002) or the development of the velospot® bike-sharing system in Bienne (project velospot® 2008 - ongoing), innovation and research on new forms of shared mobility have been and still are at the heart of its concerns and particularly in its current work."
    },
    {
      "name": "Julien Glasson",
      "image": "assets/julien.jpg",
      "text": "Project Manager at Intermobility SA since 2015, Julien Glasson holds a Master's degree from the University of Lausanne in \"Sustainable Urban Planning\". Having previously worked for public authorities in the context of follow-up of road infrastructure projects and co-ordinations in spatial planning and urban services, he is notably active in the realization of the plans for the bike networks, their operational management as well as involved in the technological developments."
    },
    {
      "name": "Thierry Nkoutche",
      "image": "assets/thierry.jpg",
      "text": "Thierry Nkoutche, IT Manager since 2016 at Intermobility SA, holds a Master's degree in Information Systems from HEC Lausanne. Within the company, he benefits from his experience in the development of applications for road users to conduct its IT development projects. He notably works in areas such as new information and communication technologies and the Internet of Things."
    },
    {
      "name": "Elena Mugellini",
      "image": "assets/elena.png",
      "text": "Elena Mugellini is Professor in Computer Sciences at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO). She is the head of HumanTech Institute, which aims at improving the quality of life and well-being of human beings thanks to the ingenious use of new technologies. Elena holds a Bsc and Msc in Telecommunications Engineering and a Ph.D. in Computer Sciences. Her research expertise lies in intelligent environments, internet of things and human computer interaction as well as information management and intelligent data analysis techniques."
    },
    {
      "name": "Simon Ruffieux",
      "image": "assets/simon.png",
      "text": "Simon Ruffieux is a Senior Researcher and Scientific Collaborator at the University of Applied Sciences of Western Switzerland, Fribourg (HES-SO FR) and Member of the HumanTech Institute. He is working on several projects such as e-bikes usage optimization, astronomical telescope automation and health related projects. He is involved in teaching of several courses related to machine learning, HCI and virtual/augmented reality. He holds a diploma of Doctor of Science in Informatics from the University of Fribourg and a Master in Computer Sciences from the Swiss Federal Institute of Technology (EPFL), Switzerland. His research domains are in the area of machine learning, human-computer interaction, robotics, internet of things and virtual/augmented reality."
    },
    {
      "name": "Omar Abou Khaled",
      "image": "assets/omar.jpg",
      "text": "Omar Abou Khaled is Professor in computer science at HES-SO campus Fribourg (HEIA-FR). He holds a PhD in Computer Science received from the Perception and Automatic Control Group of HEUDIASYC Laboratory of \"Université de Technologie de Compiègne\", and a Master in Computer Science from the same university. Since 1996 he has been working as research assistant in the MEDIA group of the Theoretical Computer Science Laboratory of EPFL (Ecole Polytechnique Fédérale de Lausanne) in the field of Educational Technologies and Web Based Training research field on MEDIT and CLASSROOM 2000 ( second link) projects. He holds a Master in Computer Engineering (1991). He was International Advisor at HES-SO until august 2014. He was Head of Internationale Relations Office at EIA-FR. Head of MRU \"Advanced IT Systems Architects\" at HEIA-FR. Until 2007 He was leader of the MISG (Multimedia Information System Group). He is responsible of several projects in the field of Document Engineering, Multimodal Interfaces, Context Awareness, Ambient Intelligence, Blended Learning, and Content-Based Multimedia Retrieval. He is involved in the teaching of several courses related to Information Systems, Web Technologies & Multimodal Interfaces."
    }
  ],
  "contact":[
    {
      "title": "Software Information",
      "name": "Simon Ruffieux",
      "addresses": {"institute": "HumanTech Institute Ecole d’Ingénieurs et d’Architectes",
                    "street": "Bd de Pérolles 80",
                    "city": "1700 Fribourg"},
      "link": "http://humantech.institute/",
      "image": "assets/humantech.png"
    },
    {
      "title": "Shared Bike System & Field Implementation",
      "name": "Julien Glasson",
      "addresses": {"institute": "Intermobility SA",
                    "street": "Rue de la Gabelle 18a",
                    "city": "2503 Biel/Bienne"
      },
      "link": "https://velospot.ch/",
      "image": "assets/velospot.jpg"
    }
  ]
}
